# Ввести с клавиатуры имя пользователя.
# Вывести на экран “Hello, [name]!”

name = input("Input your name:\n")
result = '"Hello, ' + name + '!"'
print(result)
