# Создать три переменные, содержащие возраст трех ближайших соседей, найти сумму и вывести ее на экран.
# Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран


student_1_age = 36
student_2_age = 28
student_3_age = 36

all_age = student_1_age + student_2_age + student_3_age
print(all_age)

average_age = all_age / 3
print(average_age)
