# Создать переменные firstname, lastname, age с соответствующими значениями
# Путем сложения получить строку вида
# Привет, меня зовут Иван Иванович, мне 35 лет
# Примечание:
# Переменную age задавать как строку ‘35’


firstname = 'Иван'
lastname = 'Иванович'
age = '35'
result = 'Привет, меня зовут ' + firstname + ' ' + lastname + ', мне ' + age + ' лет'
print(result)
