# Определить переменные всех 4 базовых типов и вывести их на экран
# >>> a = 5
# >>> print(a)

a = 5
print(a, type(a))

b = 4.8
print(b, type(b))

c = 'test string'
print(c, type(c))

d = True
print(d, type(d))
