# Создать проект, который будет содержать две папки: .venv и src.
# Папка .venv - виртуальное окружение.
# Папка src содержит файл hello.py
#
# При запуске hello.py должны выводиться две строки
# Первая строка выводит на экран ваше Имя
# Вторая строка выводит на экран вашу Фамилию


print('Dmitriy')
print('Anishchenko')
